/*************************************************************************************************/
/**
 * The MIT License (MIT)
 *
 * Copyright (c) 2014 A567W
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 * 
 * @file	KsMathCommon.h
 * @brief	数学計算のベースファイル
 * @date	2014/04/12
 * @author	A567W
 * @version	1.0.0
 */
/************************************************************************************************/
#ifndef __KSMATHCOMMON_H__
#define __KSMATHCOMMON_H__

/*===============================================================================================*/
/*                                 << インクルード >>                                             */
/*===============================================================================================*/
#include <KsBase.h>

/*===============================================================================================*/
/*                                     << 定義 >>                                                */
/*===============================================================================================*/

/*************************************************************************************************/
/**
 * ２つの値から大きい値を返す関数です。
 * @param   a   比較する値１
 * @param   b   比較する値2
 * @return      大きい方の値
 */
/*************************************************************************************************/
template <typename T> T KsMax( T a, T b )  { return (((a) > (b)) ? (a) : (b)); }

/*************************************************************************************************/
/**
 * ２つの値から小さい値を返す関数です。
 * @param   a   比較する値１
 * @param   b   比較する値2
 * @return      小さい方の値
 */
/*************************************************************************************************/
template <typename T> T KsMin( T a, T b )  { return (((a) < (b)) ? (a) : (b)); } 

/*************************************************************************************************/
/**
 * ２浮動小数点の値が等しいかどうかを調べる関数。
 * @param   a           比較する値１
 * @param   b           比較する値2
 * @retval  ksTRUE      等しい。
 * @retval  ksFALSE     等しくない。
 * @note                小数点誤差を考慮している。
 */
/*************************************************************************************************/
ksINLINE KsBool KsEquals( KsReal a, KsReal b )
{
	return (a + ksTOLERANCE > b) && (a - ksTOLERANCE < b);
}

/*************************************************************************************************/
/**
 * log を用いて、ある値に到達するための係数を求める
 * @param	_a		係数 
 * @param	_b		到達点
 * @param	_d		区間
 */
/*************************************************************************************************/
#define  KsGetLogParam( _a, _b, _d )   (KsReal)_a = (KsReal)(_b)/(KsReal)KsLogE(_d)

/*************************************************************************************************/
/**
 * log10 を用いて、ある値に到達するための係数を求める
 * @param	_a		係数 
 * @param	_b		到達点
 * @param	_d		区間
 */
/*************************************************************************************************/
#define  KsGetLog10Param( _a, _b, _d )   (KsReal)_a = (KsReal)(_b)/(KsReal)KsLog10(_d)

/*************************************************************************************************/
/**
 * 二次関数 を用いて、ある値に到達するための係数を求める
 * @param	_a		係数 
 * @param	_x		到達点
 * @param	_d		区間
 */
/*************************************************************************************************/
#define  KsGetQuadratic( _a, _x, _d ) ( (KsReal)_a = ( (KsReal)(_d)/(KsReal)((_x)*(_x)) ) )

/*************************************************************************************************/
/**
 * 1次関数 を用いて、ある値に到達するための係数を求める _a:係数 _x:区間 _d:到達点
 * @param	_a		係数 
 * @param	_x		到達点
 * @param	_d		区間
 */
/*************************************************************************************************/
#define  KsGetLinear(_a,_x,_d ) ( (KsReal)_a = ( (KsReal)(_d)/(KsReal)( _x ) ) )

/*************************************************************************************************/
/**
 * 2次関数での計算結果
 * @param	_a		係数
 * @param	_x		X
 */
/*************************************************************************************************/
#define  KsPlusLinearFunc(_a,_x)     KsFabs(_a)*(_x)

/*************************************************************************************************/
/**
 * 2次関数での計算結果
 * @param	_a		係数
 * @param	_x		X
 */
/*************************************************************************************************/
#define  KsMinusLinearFunc(_a,_x,_b) (-KsFabs(_a))*(_x)+_b

/*************************************************************************************************/
/**
 * 2次関数での計算結果
 * @param	_a		係数
 * @param	_x		X
 */
/*************************************************************************************************/
#define  KsPlusQuadraticFunc(_a,_x)  KsFabs(_a)*(_x*_x)

/*************************************************************************************************/
/**
 * 2次関数での計算結果
 * @param	_a		係数
 * @param	_x		X
 */
/*************************************************************************************************/
#define  KsMinusQuadraticFunc(_a,_x,_d,_b)  (-KsFabs(_a))*(_x -_d)*(_x -_d)+_b

/*************************************************************************************************/
/**
 * 等差級数の和を求めます
 * @param	a		初項
 * @param	d		公差
 * @param	n		項数
 */
/*************************************************************************************************/
#define  KsSumArithmeticalSeries( _a, _d, _n ) ( (_n)*( 2*(_a) + (_n-1)*(_d) ) /2.0f )

/*************************************************************************************************/
/**
 * 等比級数の和を求めます
 * @param	a		初項
 * @param	d		公比
 * @param	n		項数
 */
/*************************************************************************************************/
#define  KsSumGeometricalSeries(a,r,n)  ((KsReal)a)*(1.0f-(KsReal)KsPow(r,n) )/(KsReal)(1.0f-((KsReal)r))  

/*************************************************************************************************/
/**
 * 楕円円周公式 近似
 * @param	a		近傍
 * @param	b		遠傍
 */
/*************************************************************************************************/
#define  KsEllipseFunc(a,b) (ksPI*KsSqrt(2*(a*a + b*a)) - (a-b)*(a-b)/2.2f)

/*************************************************************************************************/
/**
 * ΣN
 */
/*************************************************************************************************/
#define  KsSigmaN( _a )  (1.0f/2.0f)*((KsInt32)_a)*((KsInt32)_a+1)

/*************************************************************************************************/
/**
 * ΣN2乗
 */
/*************************************************************************************************/
#define  KsSigmaNSquare( _a )  (1.0f/6.0f)*((KsInt32)_a)*((KsInt32)_a+1)*(2*(KsInt32)_a + 1 )

/*************************************************************************************************/
/**
 * ΣN3乗
 */
/*************************************************************************************************/
#define  KsSigmaNTriple( _a )  KsSigmaN( _a ) * KsSigmaN( _a )


#endif	/* __KSMATHCOMMON_H__ */


