/************************************************************************************************/
/** 
 * @file		KsShaderParam.h
 * @brief		シェーダーパラメータ
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSSHADERPARAM_H__
#define __KSSHADERPARAM_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "KsBase.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
ksNS_KS_BEGIN

/************************************************************************************************/
/**
 * @enum		ksSHADER_PARAM
 * @brief		シェーダーパラメータ
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
enum ksSHADER_PARAM
{
	ksSHADER_TIME,
	ksSHADER_WORLD_MATRIX,
	ksSHADER_VIEW_MATRIX,
	ksSHADER_WORLD_VIEW_MATRIX,
	ksSHADER_VIEW_PROJECTION_MATRIX,
	ksSHADER_WORLD_VIEW_PROJECTION_MATRIX,
	ksSHADER_MATERIAL_DIFFUSE,
	ksSHADER_MATERIAL_AMBIENT,
	ksSHADER_MATERIAL_SPECULER,
	ksSHADER_LIGHT_DIFFUSE,
	ksSHADER_LIGHT_AMBIENT,
	ksSHADER_LIGHT_SPECULER,
	ksSHADER_GLOBAL_DATA_MAX,
	ksSHADER_FORCE32          = 0x7fffffff,
};

ksNS_KS_END

#endif		/* __KSSHADERPARAM_H__ */

