/************************************************************************************************/
/** 
 * @file		KsFileThread.cpp
 * @brief		ファイルスレッド
 * @author		A567W
 * @date		2011/07/02
 * @since		2011/07/02
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSFILETHREAD_H__
#define __KSFILETHREAD_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsFileCommon.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/

ksNS_KS_BEGIN

class KsFileSystem;

/************************************************************************************************/
/**
 * ファイルスレッド
 * @class	KsFileThread
 * @author  A567W
 * @since   2003/03/22
 * @version ----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsFileThread
{
	public:
		/**
		 * コンストラクタ
		 */
										KsFileThread( KsFileSystem* pFileSystem, ksTHREAD_PRIORITY_TYPE priority, KsUInt32 prosessor );

		/**
		 * デストラクタ
		 */
										~KsFileThread();

        /**
         * スレッドのメイン関数
         * @return	実行終了結果
         */
        KsUInt32                        workerFunc();

		/**
		 * ファイルスレッドを実行する
		 */
		KsBool							run();

		/**
		 * ウエイトイベントをセットする
		 */
		void							setWaitEvent();

		/**
		 * 同期イベントをセットする
		 */
		void							setSyncEvent();

		/**
		 * ウエイトイベントをリセットする
		 */
		void							resetWaitEvent();

		/**
		 * 同期イベントをリセットする
		 */
		void							resetSyncEvent();

	private:
        KsThread*                       m_pFileThread;          /**< File Therad        */
		KsFileSystem*					m_pFileSystem;			/**< ファイルシステム		*/
		ksTHREAD_PRIORITY_TYPE			m_priority;				/**< プライオリティ		*/
		KsUInt32						m_prosessor;			/**< プロセッサ番号		*/
		KsBool							m_bThreadLoop;			/**< スレッドループ		*/
		KsEvent                         m_waitEvent;			/**< ウエイトイベント		*/
		KsEvent                         m_syncEvent;			/**< 同期イベント			*/
};

ksNS_KS_END


#endif	/* __KSFILETHREAD_H__ */


