/************************************************************************************************/
/** 
 * @file		KsBlendStateGL.h
 * @brief		DirectX用深度ステンシルステート
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSDBLENDSTATEGL_H__
#define __KSDBLENDSTATEGL_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "KsCommonGL.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
ksNS_KS_BEGIN

/************************************************************************************************/
/**
 * @class		KsBlendStateGL
 * @brief		深度ステンシルステート
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @note		参照カウンタつき
 */
/************************************************************************************************/
class ksENGINE_API KsBlendStateGL : public KsBlendState
{
		friend class KsRenderSystemGL;
		friend class KsRenderContextGL;

	public:
		/**
		 * コンストラクタ
		 */
											KsBlendStateGL( KsRenderSystemGL* pRenderSystem, const KS_BLEND_DESC* pBlendStateDesc );

		/**
		 * デストラクタ
		 */
		virtual								~KsBlendStateGL();

		/**
		 * テクスチャの破棄
		 */
		virtual void						destroy();

		/**
		 * リソースを取得する
		 * @return							リソース
		 */
		virtual void*						getRenderResource();
};

ksNS_KS_END

#endif		/* __KSDBLENDSTATEGL_H__ */

