/************************************************************************************************/
/** 
 * @file		KsConstantBufferGL.cpp
 * @brief		定数バッファ
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsConstantBufferGL.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
ksNS_KS_BEGIN

/************************************************************************************************/
/*
 * コンストラクタ
 * @param	pRenderSystem	描画システム
 * @param	pData			データ読み込み用のポインタ
 * @param	size			データサイズ
 */
/************************************************************************************************/
KsConstantBufferGL::KsConstantBufferGL( KsRenderSystemGL* pRenderSystem, void* pData, KsUInt32 size, KsUInt32 flags )
	: m_pRenderSystem( pRenderSystem )
{
	create( pRenderSystem, pData, size, flags );
}

/************************************************************************************************/
/*
 * デストラクタ
 */
/************************************************************************************************/
KsConstantBufferGL::~KsConstantBufferGL()
{
}

/************************************************************************************************/
/*
 * 定数バッファを生成する
 * @param	pRenderSystem	描画システム
 * @param	pData			データ読み込み用のポインタ
 * @param	size			データサイズ
 * @param	flags			フラグ
 * @retval	ksTRUE			生成成功
 * @retval	ksFALSE			生成失敗
 */
/************************************************************************************************/
KsBool KsConstantBufferGL::create( KsRenderSystemGL* pRenderSystem, void* pData, KsUInt32 size, KsUInt32 flags )
{
	return ksTRUE;
}

/************************************************************************************************/
/*
 * 破棄処理
 */
/************************************************************************************************/
void KsConstantBufferGL::destroy()
{
	delete this;
}

/************************************************************************************************/
/*
 * リソースを取得する
 * @return					 リソース
 */
/************************************************************************************************/
void* KsConstantBufferGL::getBufferResource()
{
	return NULL;
}

/************************************************************************************************/
/*
 * 定数バッファをロックする
 * @param	pContext		描画コンテキスト
 * @param	flags			ロックフラグ
 * @return					ロックしたバッファの先頭ポインタ
 */
/************************************************************************************************/
void* KsConstantBufferGL::lock( const KsRenderContext* pContext, KsUInt32 flags )
{
	return NULL;
}

/************************************************************************************************/
/*
 * 定数バッファのロックを解除する
 */
/************************************************************************************************/
void KsConstantBufferGL::unlock( const KsRenderContext* pContext )
{
}

/************************************************************************************************/
/*
 * 定数バッファからの読み込み
 * @param	pContext		描画コンテキスト
 * @param	pData			データ読み込み用のポインタ
 * @param	size			データサイズ
 */
/************************************************************************************************/
void KsConstantBufferGL::read( const KsRenderContext* pContext, void* pData, KsUInt32 size )
{
}

/************************************************************************************************/
/*
 * 定数バッファへの書き込み
 * @param	pContext		描画コンテキスト
 * @param	pData			データ読み込み用のポインタ
 * @param	size			データサイズ
 */
/************************************************************************************************/
void KsConstantBufferGL::write( const KsRenderContext* pContext, void* pData, KsUInt32 size )
{

}

ksNS_KS_END
