/************************************************************************************************/
/** 
 * @file		KsCommandListGL.h
 * @brief		コマンドリスト(GL用)
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/
#ifndef __KSCOMMANDLISTGL_H__
#define __KSCOMMANDLISTGL_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsCommonGL.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
ksNS_KS_BEGIN

/************************************************************************************************/
/**
 * @class		KsCommandListGL
 * @brief		コマンドリスト(GL用)
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 */
/************************************************************************************************/
class ksENGINE_API KsCommandListGL : public KsCommandList
{
	public:
		/**
		 * コンストラクタ
		 */
									KsCommandListGL();

		/**
		 * デストラクタ
		 */
		virtual						~KsCommandListGL();

		/**
		 * コマンドリストを取得する
		 */
		virtual void*				getCommandList() { return m_pCommandList; }

		/**
		 * コマンドリストBufferを取得する
		 */
		virtual void**				getCommandListBuffer() { return (void**)&m_pCommandList; }

		/**
		 * クリアーする
		 */
		virtual void				clear();

		/**
		 * コマンドを実行する。
		 */
        void                        execute();

		/**
		 * コマンドサイズを取得する
		 */
        KsUInt32                    getCommandSize() const { return m_commandSize; }

	public:
        KsByte*                     m_pCommandList;     /**< デバイスコンテキスト	*/
        KsUInt32                    m_commandSize;      /**< デバイスコンテキスト	*/
};

ksNS_KS_END

#endif		/* __KSCOMMANDLISTGL_H__ */



