/************************************************************************************************/
/** 
 * @file		KsIndexBufferGL.h
 * @brief		インデックスバッファ
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0.0
 */
/************************************************************************************************/

/*==============================================================================================*/
/*                                 << インクルード >>                                            */
/*==============================================================================================*/
#include "KsIndexBufferGL.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
ksNS_KS_BEGIN

/************************************************************************************************/
/*
 * インデックスバッファを生成する
 * @param	pDevice			デバイス
 * @param	numIndex		インデックスの数
 * @param	flags			フラグ
 */
/************************************************************************************************/
KsIndexBufferGL::KsIndexBufferGL( KsRenderSystemGL* pRenderSystem, void* pData, KsUInt32 size, KsUInt32 numIndex, KsUInt32 indexFormat, KsUInt32 flags )
	: m_pRenderSystem( pRenderSystem )
    , m_indexBuffer( 0 )
{
	create( pRenderSystem, pData, size, numIndex, indexFormat, flags );
}

/************************************************************************************************/
/*
 * デストラクタ
 */
/************************************************************************************************/
KsIndexBufferGL::~KsIndexBufferGL()
{
    if( m_indexBuffer )
    {
        glDeleteBuffers( 1, &m_indexBuffer );
        m_indexBuffer = 0;
    }
}

/************************************************************************************************/
/*
 * インデックスバッファを生成する
 * @param	pRenderSystem	描画システム
 * @param	pData			データ読み込み用のポインタ
 * @param	size			データサイズ
 * @param	numIndex		インデックスの数
 * @param	indexFormat		インデックスフォーマット
 * @param	flags			フラグ
 * @retval	ksTRUE			生成成功
 * @retval	ksFALSE			生成失敗
 */
/************************************************************************************************/
KsBool KsIndexBufferGL::create( KsRenderSystemGL* pRenderSystem, void* pData, KsUInt32 size, KsUInt32 numIndex, KsUInt32 indexFormat, KsUInt32 flags )
{
	m_numIndex = numIndex;

	//　頂点バッファの作成
    glGenBuffers( 1, &m_indexBuffer );
    glBindBuffer( GL_ARRAY_BUFFER, m_indexBuffer );
    glBufferData( GL_ARRAY_BUFFER, numIndex * indexFormat, pData, GL_STATIC_DRAW );
    glBindBuffer( GL_ARRAY_BUFFER, 0 );

	return ksTRUE;
}

/************************************************************************************************/
/*
 * 破棄処理
 */
/************************************************************************************************/
void KsIndexBufferGL::destroy()
{
	delete this;
}

/************************************************************************************************/
/*
 * インデックスバッファをロックする
 * @param	pContext		描画コンテキスト
 * @param	flags			ロックフラグ
 * @return					ロックしたバッファの先頭ポインタ
 */
/************************************************************************************************/
void* KsIndexBufferGL::lock( const KsRenderContext* pContext, KsUInt32 flags )
{
	return NULL;
}

/************************************************************************************************/
/*
 * インデックスバッファのロックを解除する
 */
/************************************************************************************************/
void KsIndexBufferGL::unlock( const KsRenderContext* pContext )
{
}

/************************************************************************************************/
/*
 * インデックスバッファからの読み込み
 * @param	pContext		描画コンテキスト
 * @param	pData			データ読み込み用のポインタ
 * @param	size			データサイズ
 */
/************************************************************************************************/
void KsIndexBufferGL::read( const KsRenderContext* pContext, void* pData, KsUInt32 size )
{
}

/************************************************************************************************/
/*
 * インデックスバッファへの書き込み
 * @param	pContext		描画コンテキスト
 * @param	pData			データ読み込み用のポインタ
 * @param	size			データサイズ
 */
/************************************************************************************************/
void KsIndexBufferGL::write( const KsRenderContext* pContext, void* pData, KsUInt32 size )
{
}

ksNS_KS_END

