/************************************************************************************************/
/** 
 * @file		KsRasterizerStateGL.h
 * @brief		DirectX用深度ステンシルステート
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @version		1.0
 */
/************************************************************************************************/
#ifndef __KSRASTERIZERSTATEGL_H__
#define __KSRASTERIZERSTATEGL_H__

/*==============================================================================================*/
/*                                 << インクルード >>                                           */
/*==============================================================================================*/
#include "KsCommonGL.h"

/*==============================================================================================*/
/*                                     << 定義 >>                                               */
/*==============================================================================================*/

/*==============================================================================================*/
/*                                     << 宣言 >>                                               */
/*==============================================================================================*/
ksNS_KS_BEGIN

/************************************************************************************************/
/**
 * @class		KsRasterizerStateGL
 * @brief		深度ステンシルステート
 * @author		A567W
 * @date		----/--/--
 * @since		----/--/--
 * @note		参照カウンタつき
 */
/************************************************************************************************/
class ksENGINE_API KsRasterizerStateGL : public KsRasterizerState
{
		friend class KsRenderSystemGL;
		friend class KsRenderContextGL;
	public:
		/**
		 * コンストラクタ
		 */
											KsRasterizerStateGL( KsRenderSystemGL* pRenderSystem, const KS_RASTERIZER_DESC* pRasterizerState );


		/**
		 * デストラクタ
		 */
		virtual								~KsRasterizerStateGL();

		/**
		 * テクスチャの破棄
		 */
		virtual void						destroy();

		/**
		 * リソースを取得する
		 * @return							リソース
		 */
		virtual void*						getRenderResource();
};

ksNS_KS_END

#endif		/* __KSRASTERIZERSTATEGL_H__ */

